Show / Hide Table of Contents
Class RigidLink
Rigid link between nodes
Inheritance
System.Object
OpenObject
OpenElementId
RigidLink
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RigidLink,CI.StructuralElements", "CI.StructModel.Structure.IRigidLink,CI.BasicTypes")]
public class RigidLink : OpenElementId
Constructors
Improve this Doc   View Source
RigidLink()
Constructor
Declaration
public RigidLink()
Properties
Improve this Doc   View Source
MasterNode
Node to which all six independent degrees of freedom for the element are assigned
Declaration
public ReferenceElement MasterNode { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
RigidRX
DOF rigid in RX dirrection
Declaration
public bool RigidRX { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
RigidRY
DOF rigid in RY dirrection
Declaration
public bool RigidRY { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
RigidRZ
DOF rigid in RZ dirrection
Declaration
public bool RigidRZ { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
RigidX
DOF rigid in X dirrection
Declaration
public bool RigidX { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
RigidZ
DOF rigid in Z dirrection
Declaration
public bool RigidZ { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SlaveNodes
Dependent nodes
Declaration
public List<ReferenceElement> SlaveNodes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
 Improve this Doc
 View Source